WSM_I85B78/CFD/0/ccz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
635
(
0.000125
0.000375
0.000625
0.000875
0.001125
0.001375
0.001625
0.001875
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    wall_top
    {
        type            calculated;
        value           uniform 0.4;
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
